let allPlaces = [
    { id: 1, name: "ИРИТ-РТФ", lat: 56.773109, lon: 60.761112, type: "admin", desc: "Институт радиоэлектроники и информационных технологий" },
    { id: 2, name: "ИНЭУ", lat: 56.773731, lon: 60.764462, type: "admin", desc: "Институт экономики и управления" },
    { id: 3, name: "Столовая ИРИТ-РТФ", lat: 56.773300, lon: 60.761500, type: "food", desc: "Столовая в здании ИРИТ, работает с 9:00 до 16:00" },
    { id: 4, name: "Библиотека", lat: 56.773500, lon: 60.762800, type: "lib", desc: "Читальный зал, выдача учебной литературы" },
    { id: 5, name: "Проходная", lat: 56.773000, lon: 60.761800, type: "other", desc: "Центральная проходная кампуса" }
];

const campusCenter = {
    lat: 56.773420,
    lon: 60.762787
};